Q-1. Write an SQL query to fetch “FIRST_NAME” from Worker table using the alias name as WORKER_NAME.

In [2]:
import mysql.connector
from mysql.connector import Error

try:
    connection = mysql.connector.connect(host='localhost',
                                         user='root',
                                         password='Am!t@kmr_2$@2')

except Error as e:
    print("Error while connecting to MySQL", e)

In [3]:
if connection.is_connected():
        db_Info = connection.get_server_info()
        print("Connected to MySQL Server version ", db_Info)
        cursor = connection.cursor()
        #cursor.execute("create database workdatabase;")
        #cursor.execute("use workdatabase;")
        print("You're connected to database: ")

Connected to MySQL Server version  8.0.28
You're connected to database:

In [3]:
if connection.is_connected():
    cursor.execute("CREATE TABLE salgrade(grade int(4) not null primary key,losal decimal(10,2),hisal decimal(10,2));")
    cursor.execute("CREATE TABLE dept(deptno int(2) not null primary key,dname varchar(50) not null,location varchar(50) not null);")
    cursor.execute("CREATE TABLE emp(empno int(4) not null primary key,ename varchar(50) not null,job varchar(50) not null,mgr int(4),hiredate date,sal decimal(10,2),comm decimal(10,2),deptno int(2) not null);")
    connection.commit()

In [4]:
cursor.execute("insert into dept values (10,'Accounting','New York');")
cursor.execute("insert into dept values (20,'Research','Dallas');")
cursor.execute("insert into dept values (30,'Sales','Chicago');")
cursor.execute("insert into dept values (40,'Operations','Boston');")
connection.commit()

In [5]:
cursor.execute("insert into emp values (7369,'SMITH','CLERK',7902,'93/6/13',800,0.00,20);")
cursor.execute("insert into emp values (7499,'ALLEN','SALESMAN',7698,'98/8/15',1600,300,30);")
cursor.execute("insert into emp values (7521,'WARD','SALESMAN',7698,'96/3/26',1250,500,30);")
cursor.execute("insert into emp values (7566,'JONES','MANAGER',7839,'95/10/31',2975,null,20);")
cursor.execute("insert into emp values (7698,'BLAKE','MANAGER',7839,'92/6/11',2850,null,30);")
cursor.execute("insert into emp values (7782,'CLARK','MANAGER',7839,'93/5/14',2450,null,10);")
cursor.execute("insert into emp values (7788,'SCOTT','ANALYST',7566,'96/3/5',3000,null,20);")
cursor.execute("insert into emp values (7839,'KING','PRESIDENT',null,'90/6/9',5000,0,10);")
cursor.execute("insert into emp values (7844,'TURNER','SALESMAN',7698,'95/6/4',1500,0,30);")
cursor.execute("insert into emp values (7876,'ADAMS','CLERK',7788,'99/6/4',1100,null,20);")
cursor.execute("insert into emp values (7900,'JAMES','CLERK',7698,'00/6/23',950,null,30);")
cursor.execute("insert into emp values (7934,'MILLER','CLERK',7782,'00/1/21',1300,null,10);")
cursor.execute("insert into emp values (7902,'FORD','ANALYST',7566,'97/12/5',3000,null,20);")
cursor.execute("insert into emp values (7654,'MARTIN','SALESMAN',7698,'98/12/5',1250,1400,30);")
connection.commit()

In [6]:
cursor.execute("insert into salgrade values (1,700,1200);")
cursor.execute("insert into salgrade values (2,1201,1400);")
cursor.execute("insert into salgrade values (3,1401,2000);")
cursor.execute("insert into salgrade values (4,2001,3000);")
cursor.execute("insert into salgrade values (5,3001,99999);")
connection.commit()

In [4]:
cursor.execute ("use workdatabase")

In [9]:
cursor.execute("select ename as WORKER_NAME from emp;")

In [10]:

cursor.fetchall()

[('SMITH',),
 ('ALLEN',),
 ('WARD',),
 ('JONES',),
 ('MARTIN',),
 ('BLAKE',),
 ('CLARK',),
 ('SCOTT',),
 ('KING',),
 ('TURNER',),
 ('ADAMS',),
 ('JAMES',),
 ('FORD',),
 ('MILLER',)]

Q-2. Write an SQL query to fetch unique values of DEPARTMENT from Worker table.

In [11]:
cursor.execute("select distinct b.dname  from emp a , dept b where a.deptno=b.deptno")
cursor.fetchall()

[('Research',), ('Sales',), ('Accounting',)]

Q-3. Write an SQL query to show the last 5 record from a table.

In [5]:
cursor.execute("select * from emp order by empno desc limit 5;")

In [6]:
cursor.fetchall()

[(7934,
  'MILLER',
  'CLERK',
  7782,
  datetime.date(2000, 1, 21),
  Decimal('1300.00'),
  None,
  10),
 (7902,
  'FORD',
  'ANALYST',
  7566,
  datetime.date(1997, 12, 5),
  Decimal('3000.00'),
  None,
  20),
 (7900,
  'JAMES',
  'CLERK',
  7698,
  datetime.date(2000, 6, 23),
  Decimal('950.00'),
  None,
  30),
 (7876,
  'ADAMS',
  'CLERK',
  7788,
  datetime.date(1999, 6, 4),
  Decimal('1100.00'),
  None,
  20),
 (7844,
  'TURNER',
  'SALESMAN',
  7698,
  datetime.date(1995, 6, 4),
  Decimal('1500.00'),
  Decimal('0.00'),
  30)]

In [7]:
cursor.close()
connection.close()
print("MySQL connection is closed")

MySQL connection is closed